app/controllers/password_resets_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.authenticate(params[:user][:old_password]) || current_user.admin?
      if !params[:user][:password].blank?
        if @user.update_attributes(password_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$xFl9lfhVqRXM/Y.H3lqC4.RqI8ehKZ5sMwxovyd9IOMjVLtcjgpuC"], ["updated_at", "2016-05-19 20:45:36.400651"], ["id", 8]]