app/controllers/proposals_controller.rb

SELECT COUNT(*) FROM "proposals"
---
  def index
    @proposal  = Proposal.new
    @proposals = Proposal.all.order(counter: :desc)

INSERT INTO "proposals" ("name", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    proposal = Proposal.find_by(name: params[:proposal][:name])
    if proposal == nil
      @proposal = Proposal.create(proposal_params)

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 4]]
---
  def edit
    @proposal = Proposal.find(params[:id])

SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "proposals" SET "avatar" = $1, "updated_at" = $2 WHERE "proposals"."id" = $3  [["avatar", "https://media.licdn.com/mpr/mpr/shrink_100_100/AAEAAQAAAAAAAAMCAAAAJDRiNmViNGM1LWNmYzAtNDUxYS05YjU5LTMxOTg3YjRiNDNiNw.jpg"], ["updated_at", "2016-04-22 23:01:25.881073"], ["id", 4]]
---
  def update
    @proposal = Proposal.find(params[:id])
    if @proposal.update(proposal_params)

DELETE FROM "proposals" WHERE "proposals"."id" = $1  [["id", 3]]
SELECT  "proposals".* FROM "proposals" WHERE "proposals"."id" = $1 LIMIT 1  [["id", 3]]
---
  def destroy
    Proposal.find(params[:id]).destroy