app/controllers/proposals_controller.rb

SELECT "proposals".* FROM "proposals"
---
  def index
    @proposal  = Proposal.new
    @proposals = Proposal.all