app/controllers/users_controller.rb

  def index
    @users = User.all.normal_users
    @admins = User.all.admins
---
SELECT "users".* FROM "users" WHERE "users"."admin" = $1  [["admin", "f"]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "api_token", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"